{
  "education": [
    {
      "awards_achievements": [
        "Engineering Entrance Scholarship",
        "Dean's List (2020-2021)"
      ],
      "degree": "Bachelor of Engineering",
      "department": "Computer Engineering",
      "duration": "2017-2021",
      "school_name": "Ryerson University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_KeithanBalasubramaniam",
  "highlighted_projects": [
    {
      "description": "Designed an application where a user can follow along an exercise routine by a trainer on a video, and dynamically receive real time feedback on quality of form as a score. Developed application's body tracking algorithim in Python using OpenCV and TensorFlow. Implemented convolutional neural networking and dynamic time warping to compute real time user scoring metrics.",
      "git_url": "https://github.com/KeithanBala/AI-Personal-Trainer",
      "name": "AI Personal Trainer"
    },
    {
      "description": "Created an application that allows exchanges of files and media among connected peer networks. Implemented UDP and TCP connections with an index server and peer networks using sockets in C. Designed functionalities for users to upload and delete files to be shared to other connected peer networks via the index server.",
      "git_url": "https://github.com/KeithanBala/P2P-Application",
      "name": "Peer-to-Peer Application"
    },
    {
      "description": "Implemented a maze solving algorithim in Assembly on a miniature robot car to react to obstacles and dead end paths to allow the robot to learn all possible routes through the maze. Integrated sensors to read, and follow possible paths to traverse the maze backwards.",
      "name": "Intelligent Autonomous Robot Car"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented a tool using bash scripts that gathers data on hardware specifications of a network of Linux machines. This application monitors their resource usage in real time, and store the data to a PSQL database maintained in a docker instance.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Developed a Twitter CLI application that implemented Maven, Mockito, JSON, Spring, JUnit, and the Twitter API to allow users to post, search, and delete tweets from the command line. Preformed agile testing by creating and executing JUnit test scripts for the application, and deployed the application using Docker to DockerHub.",
        "JDBC App: Implemented an application to store customer and sales data for a sample enterprise for the purpose of exploring the JDBC library and common data persitence design patterns. This application was developed using Java with a PSQL instance for data storage maintained docker container.",
        "Grep App: Developed an application that mirrors the Linux bash grep function. This application was developed using Java to search for a matching regex pattern in a directory."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "In Development.",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "In Development.",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "In Development.",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "In Development.",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "In Development.",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Keithan Balasubramaniam",
  "others": [
    {
      "bullets": [
        "Running Marathons"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Developed Data Engineering projects in Java with the use of other technologies such as Maven, Docker, Git, PSQL, and REST APIs. Collaborated with a team in daily Scrum meetings and bi-weekly sprint meetings to implement Agile development practices.",
      "duration": "2021-present",
      "title": "Data and Applications Engineer"
    },
    {
      "company": "DM\u0026T Services LTD.",
      "description": "Worked with the Ministry of Transportation and The Miller Group to develop a snowplow tracking application. Helped design and implement the UI using HTML and CSS for driver applications. Integrated backend screen monitoring configurations on both Andriod and Apple devices using Soti MobiControl. Depolyed all testing frameworks for application prior to MTO and Miller application launch.",
      "duration": "2015-2017",
      "title": "Software Developer Intern"
    }
  ],
  "skills": {
    "competent": [
      "HTML",
      "REST APIs",
      "CSS",
      "C",
      "C++",
      "Matlab"
    ],
    "familiar": [
      "TensorFlow",
      "OpenCV",
      "VHDL",
      "Swift",
      "Javascript"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git",
      "Python",
      "Docker"
    ]
  },
  "summary": "I am a recent graduate from Ryerson University where I received my Bachelor of Engineering, majoring in Computer Engineering. Throughout my education at Ryerson I have developed solid coding, analytical, and problem solving skills. I found an interest in data engineering in my final year of university, which is a discipline that includes all the exciting aspects of software development that I am passionate about. I have completed an intership at DM\u0026T, a software solutions company, where I worked as a developer on their joint project with the Ontario Ministry of Transportation to implement backend screen monitoring and UI design of their user/driver application. I am a hardworking and highly motivated individual that enjoys being challenged and engaging with projects that require me to work outside of my comfort and knowledge set, as continuing to learn new languages and developement techinques are import to me and the success of your organization. I believe that clear communication streams and increased transparency can help organizations build highly efficient, successful and confident teams that are extremely capable of creating products and solutions that consumers love. I strongly feel that my academic background in Computer Engineering and my practical experience working as a Software Developer Intern will allow me to make a meaninful contribution to your team."
}
